===
Simple binary expression
===

1 + 2

---

(source_file
    (binary_expression
        (integer_literal)
        (integer_literal)))

===
Complex expression with precedence
===

1 + 2 * 3

---

(source_file
    (binary_expression
        (integer_literal)
        (binary_expression
            (integer_literal)
            (integer_literal))))

===
Complex expression with minus integer in unary 
===

-1 + 2 * 3

---

(source_file
    (binary_expression
        (unary_expression
            (integer_literal))
        (binary_expression
            (integer_literal)
            (integer_literal))))

===
Expression with parenthesized and binary expression
===

1 - (1 + 1)

---

(source_file
    (binary_expression
        (integer_literal)
        (parenthesized_expression
            (binary_expression
                (integer_literal)
                (integer_literal)))))
