===
Simple user identifier
===

{{ identifier }}

---

(source_file
    (expression_block
    (user_identifier)))

===
Simple namespace identifier
===

{{ @namespace }}

---

(source_file
    (expression_block
    (namespace_identifier
        (namespace_name))))

===
Namespace identifier with value
===

{{ @namespace::value }}

---

(source_file
    (expression_block
    (namespace_identifier
        (namespace_name)
        (namespace_value))))

===
Namespace identifier with value (specific)
===

{{
@namespace 
:: 
value
}} 

---

(source_file
    (expression_block
    (namespace_identifier
        (namespace_name)
        (namespace_value))))


